In [2]:
import pandas as pd
import numpy as np

In [11]:
rng = np.random.default_rng(42)
ser = pd.Series(rng.integers(0,10,4))
ser

0    0
1    7
2    6
3    4
dtype: int64

In [16]:
df = pd.DataFrame(rng.integers(0, 10, (3, 5)),
                  columns=['A', 'B', 'C', 'D', 'E'])
df

   A  B  C  D  E
0  7  3  9  4  3
1  9  3  0  4  7
2  1  4  1  6  4

In [18]:
np.exp(ser)

0       1.000000
1    1096.633158
2     403.428793
3      54.598150
dtype: float64

In [20]:
np.sin(df*np.pi/4)

          A             B         C             D             E
0 -0.707107  7.071068e-01  0.707107  1.224647e-16  7.071068e-01
1  0.707107  7.071068e-01  0.000000  1.224647e-16 -7.071068e-01
2  0.707107  1.224647e-16  0.707107 -1.000000e+00  1.224647e-16

In [24]:
area = pd.Series({'Alaska': 288712, 'Texas': 32123, 'California': 434123}, name='area')
population = pd.Series({'Alaska': 8889912, 'Texas': 891812, 'Florida': 8284812}, name='population')

In [25]:
population / area

Alaska        30.791626
California          NaN
Florida             NaN
Texas         27.762413
dtype: float64

In [26]:
area.index.union(population.index)

Index(['Alaska', 'California', 'Florida', 'Texas'], dtype='object')

In [28]:
A = pd.Series([2,4,6],[0,1,2]) 
B = pd.Series([1,3,5],[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [31]:
A.add(B)

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [32]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [35]:
A = pd.DataFrame(rng.integers(0,20, (2,2)),
                 columns =['a', 'b'])
A

    a   b
0  12  14
1   1   6

In [45]:
B = pd.DataFrame(rng.integers(0,10, (3,3)),
                 columns=['b','a','c'])
B

   b  a  c
0  3  2  7
1  8  1  9
2  4  8  2

In [47]:
A + B

      a     b   c
0  14.0  17.0 NaN
1   2.0  14.0 NaN
2   NaN   NaN NaN

In [49]:
A.add(B)

      a     b   c
0  14.0  17.0 NaN
1   2.0  14.0 NaN
2   NaN   NaN NaN

In [51]:
A.add(B, fill_value=A.values.mean())

       a      b      c
0  14.00  17.00  15.25
1   2.00  14.00  17.25
2  16.25  12.25  10.25

In [55]:
A = rng.integers(10, size=(3,4))
A

array([[4, 6, 6, 1],
       [2, 3, 0, 2],
       [2, 5, 8, 8]])

In [71]:
a =10//5
a

2

In [74]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-2, -3, -6,  1],
       [-2, -1,  2,  7]])

In [76]:
df = pd.DataFrame(A, columns=['Q', 'R', 'S', 'T'])
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -2 -3 -6  1
2 -2 -1  2  7

In [79]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0 -2  0  0 -5
1 -1  0 -3 -1
2 -3  0  3  3

In [80]:
halfrow = df.iloc[0, ::2]
halfrow

Q    4
S    6
Name: 0, dtype: int64

In [81]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -2.0 NaN -6.0 NaN
2 -2.0 NaN  2.0 NaN